app/views/users/_form.erb

SELECT 1 FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" IS NULL AND "roles"."id" = 1 LIMIT 1
---
      <div>
        <%= check_box_tag "user[role_ids][]", role.id, @user.roles.include?(role) %>