app/controllers/pages_controller.rb

  def show
    if params[:permalink]
      @page = Page.find_by_permalink(params[:permalink])
      raise ActiveRecord::RecordNotFound, "Pagina no encontrada" if @page.nil?
    else
      @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT 1  [["id", "1"]]