app/controllers/roles_controller.rb

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @role = Role.find(params[:id])

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @role = Role.find(params[:id])

INSERT INTO "roles" ("created_at", "descripcion", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 06 Feb 2012 10:35:25 UTC +00:00], ["descripcion", "Prueba"], ["name", "prueba"], ["updated_at", Mon, 06 Feb 2012 10:35:25 UTC +00:00]]
---
  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save

SELECT "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "roles" SET "name" = 'prueba2', "descripcion" = 'Prueba2', "updated_at" = '2012-02-06 10:35:37.232489' WHERE "roles"."id" = 3
---
  def update
    @role = Role.find(params[:id])

    respond_to do |format|
      if @role.update_attributes(params[:role])