app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "encrypted_password" = '$2a$10$drcyDWZ5GZd5lceJqZ0LfuRmIl906dQSXZeqwh0yX2Pw5cKvuOBKC', "updated_at" = '2012-02-13 12:42:11.479680' WHERE "users"."id" = 1